programming/python/idiomatic-python-note.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-06-11 Sun 11:52 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Note on "Code Like a Pythonista: Idiomatic Python"</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Zhao WenBin">
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Note on "Code Like a Pythonista: Idiomatic Python"</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf5fee53">说明</a></li>
<li><a href="#orgab63b8b">Zen of Python</a></li>
<li><a href="#org8900cf5">Coding Style</a></li>
<li><a href="#org75303df">Practicality vs Purity</a></li>
<li><a href="#orga1a3809">范式</a></li>
<li><a href="#org2e30c61">Simple is Better Than Complex</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgf5fee53" class="outline-2">
<h2 id="orgf5fee53">说明</h2>
<div class="outline-text-2" id="text-orgf5fee53">
<p>
笔记摘录自 <a href="http://python.net/~goodger/projects/pycon/2007/idiomatic/handout.html#simple-is-better-than-complex">Code Like a Pythonista: Idiomatic Python</a>
</p>
</div>
</div>

<div id="outline-container-orgab63b8b" class="outline-2">
<h2 id="orgab63b8b">Zen of Python</h2>
<div class="outline-text-2" id="text-orgab63b8b">
<p>
使用 <code>import this</code> 来查看 python zen, 在 PEP20 中正式定义
</p>


<pre class="example">
The Zen of Python, by Tim Peters

Beautiful is better than ugly.
Explicit is better than implicit.
Simple is better than complex.
Complex is better than complicated.
Flat is better than nested.
Sparse is better than dense.
Readability counts.
Special cases aren't special enough to break the rules.
Although practicality beats purity.
Errors should never pass silently.
Unless explicitly silenced.
In the face of ambiguity, refuse the temptation to guess.
There should be one-- and preferably only one --obvious way to do it.
Although that way may not be obvious at first unless you're Dutch.
Now is better than never.
Although never is often better than *right* now.
If the implementation is hard to explain, it's a bad idea.
If the implementation is easy to explain, it may be a good idea.
Namespaces are one honking great idea -- let's do more of those!
</pre>
</div>

<div id="outline-container-org4b445be" class="outline-3">
<h3 id="org4b445be">心得</h3>
<div class="outline-text-3" id="text-org4b445be">
<ul class="org-ul">
<li>大巧不工</li>
<li>道可道，非常道</li>
<li>不要隐藏问题，尽快解决，至少让它能及时反映出来</li>
<li>不要过度追求代码的完善，完成功能是首要的</li>
<li>要有原则，有所不为，过多的特例只会成为惯例</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org8900cf5" class="outline-2">
<h2 id="org8900cf5">Coding Style</h2>
<div class="outline-text-2" id="text-org8900cf5">
<blockquote>
<p>
Programms must be written for people to read, and only incidentally for machines to execute. &#x2013; SICP
</p>
</blockquote>

<p>
Python 推荐的编码风格参考 PEP08
</p>
</div>


<div id="outline-container-org3053a9d" class="outline-3">
<h3 id="org3053a9d">Whitespace</h3>
<div class="outline-text-3" id="text-org3053a9d">
<ul class="org-ul">
<li>4 个空格缩进</li>
<li>不要混合 tabs 和 spaces</li>
<li>函数间以一个空行分隔</li>
<li>Class 前加两个空行</li>
<li>在 dict, list, tuple 中逗号分隔后加空格；同理，在 dict 的冒号后加空格</li>
<li>在赋值或比较前后加空格分隔</li>
<li>圆括号前后不要加空格</li>
</ul>
</div>
</div>

<div id="outline-container-org1e9a1ad" class="outline-3">
<h3 id="org1e9a1ad">命名</h3>
<div class="outline-text-3" id="text-org1e9a1ad">
<ul class="org-ul">
<li>下划线命名</li>
<li>大写用于常量</li>
<li>类名用骆驼命名法</li>
<li>使用 <code>_name</code> 表示私有变量，不要用两个下划线开头</li>
<li>python 中以两个下划线开头的变量，实际上被展开成为 <code>_ClassName__PrivateName</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgdcde8c5" class="outline-3">
<h3 id="orgdcde8c5">Long Lines &amp; Continuations</h3>
<div class="outline-text-3" id="text-orgdcde8c5">
<ul class="org-ul">
<li>保持一行 80 个字符</li>
<li>括号内部可以直接换行</li>
<li>其余场景需要以反斜线和换行（反斜线前不要加空格）</li>
</ul>
</div>
</div>

<div id="outline-container-org9034bda" class="outline-3">
<h3 id="org9034bda">Long Strings</h3>
<div class="outline-text-3" id="text-org9034bda">
<ul class="org-ul">
<li>多个字符串用在解释时被拼接，如 <code>print 'o' 'n' 'e'</code></li>
<li>字符串前缀以 'r' 表示 raw string, 其中的反斜转义失效，可以用于写正则式</li>
<li><p>
三引号内可以换行，但首行需要加反斜线来去掉空行，如
</p>
<div class="org-src-container">
<pre class="src src-python">'''\
Triple
single
quotes\
'''
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org85be083" class="outline-3">
<h3 id="org85be083">Compound Statements</h3>
<div class="outline-text-3" id="text-org85be083">
<ul class="org-ul">
<li>虽然可以将 if 或 while 的 statement 写在一行</li>
<li>但是最好还是按规则分开来写</li>
<li>Multiple statements on one line are a cardinal sin.</li>
</ul>
</div>
</div>

<div id="outline-container-orge544088" class="outline-3">
<h3 id="orge544088">Docstrings &amp; Comments</h3>
<div class="outline-text-3" id="text-orge544088">
<ul class="org-ul">
<li>docstring 用于说明如何使用</li>
<li>comments 用于解释为何和怎样实现的</li>
<li>False comments &amp; docstrings are worse than none at all.</li>
<li>参考 PEP257 "Docstring Conventions"</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org75303df" class="outline-2">
<h2 id="org75303df">Practicality vs Purity</h2>
<div class="outline-text-2" id="text-org75303df">
<p>
打破纯净的场景如
</p>

<ol class="org-ol">
<li>纯净性使代码完全不可读</li>
<li>与历史上的问题等纠结一起</li>
</ol>
</div>
</div>

<div id="outline-container-orga1a3809" class="outline-2">
<h2 id="orga1a3809">范式</h2>
<div class="outline-text-2" id="text-orga1a3809">
</div><div id="outline-container-org451c096" class="outline-3">
<h3 id="org451c096">Swap Values</h3>
<div class="outline-text-3" id="text-org451c096">
</div><div id="outline-container-org4ac4f1f" class="outline-4">
<h4 id="org4ac4f1f">例子</h4>
<div class="outline-text-4" id="text-org4ac4f1f">
<div class="org-src-container">
<pre class="src src-python">b, a = a, b
</pre>
</div>
</div>
</div>

<div id="outline-container-org33c34df" class="outline-4">
<h4 id="org33c34df">说明</h4>
<div class="outline-text-4" id="text-org33c34df">
<ul class="org-ul">
<li>右侧为 Tuple 的构造形式</li>
<li>赋值的同时进行解构（destructure），类似于 Clojure</li>
<li>解构可以对嵌套结构进行</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org756742e" class="outline-3">
<h3 id="org756742e">More About Tuples</h3>
<div class="outline-text-3" id="text-org756742e">
<ul class="org-ul">
<li><code>1,</code> 生成一个 Tuple <code>(1,)</code></li>
<li>最好用括号显式表示: <code>(1,)</code></li>
<li>如果忘记了逗号，则生成一个数字 <code>(1)</code></li>
<li>空的 Tuple 使用 <code>()</code> 或 <code>tuple()</code> 来构造</li>
</ul>
</div>
</div>


<div id="outline-container-org4738740" class="outline-3">
<h3 id="org4738740">Interactive "_"</h3>
<div class="outline-text-3" id="text-org4738740">
<ul class="org-ul">
<li>交互解析时，"_" 保存上次计算的结果</li>
</ul>
</div>
</div>


<div id="outline-container-org5c89e43" class="outline-3">
<h3 id="org5c89e43">Building Strings from Substrings</h3>
<div class="outline-text-3" id="text-org5c89e43">
<ul class="org-ul">
<li>使用 <code>result = ''.join(colors)</code></li>
<li>不要使用 for 循环往字符串后追加</li>
</ul>
</div>
</div>

<div id="outline-container-org9cd7f0e" class="outline-3">
<h3 id="org9cd7f0e">Use <code>in</code> where possible</h3>
<div class="outline-text-3" id="text-org9cd7f0e">
<ul class="org-ul">
<li>用于循环取迭代器中的元素，效率高</li>
<li>对于 dictionary 直接用 in，不要用 <code>for key in d.keys()</code></li>
<li><code>in</code> 也可以用于判断元素是否在集合中</li>
</ul>
</div>
</div>


<div id="outline-container-org5eb6897" class="outline-3">
<h3 id="org5eb6897">Dictionary <code>get</code> Method</h3>
<div class="outline-text-3" id="text-org5eb6897">
<p>
经常用有需要聚合统计，将结果保存在 dict 中。
</p>

<p>
下面两种方法，第二种更好：
</p>

<div class="org-src-container">
<pre class="src src-python"># naive
navs = {}
for ( portfolio, equity, position ) in data:
    if portfolio not in navs:
	navs[portfolio] = 0
    navs[portfolio] += position * prices[equity]


# better
navs = {}
for ( position, equity, position ) in data:
    navs[position] = (navs.get(portfolio,0) + position * prices[equity])
</pre>
</div>
</div>
</div>
<div id="outline-container-org6412175" class="outline-3">
<h3 id="org6412175">Dictionary <code>setdefault</code> Method</h3>
<div class="outline-text-3" id="text-org6412175">
<p>
会有需要将集合中的元素按关键字进行分组，牵扯到为相应的键生成一个空的 list 
</p>
</div>

<div id="outline-container-org61c85ae" class="outline-4">
<h4 id="org61c85ae">示例</h4>
<div class="outline-text-4" id="text-org61c85ae">
<p>
不好的方法是
</p>

<div class="org-src-container">
<pre class="src src-python">equities = {}
for ( portfolio, equility ) in data:
    if portfolio in equility:
	equility[portfolio].append( equility )
    else:
	equility[portfolio] = [equity]
</pre>
</div>

<p>
比较好的方式是使用 <code>dict.setdefault(key, default)</code> ，如下
</p>

<div class="org-src-container">
<pre class="src src-python">equities = {}
for ( portfolio, equity ) in data:
    equities.setdefault( portfolio, [] ).append( equity )
</pre>
</div>
</div>
</div>

<div id="outline-container-org11b7881" class="outline-4">
<h4 id="org11b7881">说明</h4>
<div class="outline-text-4" id="text-org11b7881">
<ul class="org-ul">
<li><code>setdefault( key, default )</code> 进行 get 或先 set 后 get</li>
<li>只有在 key 不存在时都会设置 default</li>
<li>但每次都会重新对 default 进行求值</li>
</ul>
</div>
</div>


<div id="outline-container-orga4a56bd" class="outline-4">
<h4 id="orga4a56bd">defaultdict</h4>
<div class="outline-text-4" id="text-orga4a56bd">
</div><ul class="org-ul"><li><a id="org1e4a92d"></a>说明<br><div class="outline-text-5" id="text-org1e4a92d">
<ul class="org-ul">
<li>在 <code>collections.defaultdict</code> 定义</li>
<li>加入了默认的工厂函数</li>
<li>在对一个不存在的键作操作时，会调用 factory function 来进行初始化</li>
</ul>
</div></li>

<li><a id="org4a56577"></a>示例<br><div class="outline-text-5" id="text-org4a56577">
<div class="org-src-container">
<pre class="src src-python">from collctions import defaultdict

equities = defaultdict(list)
for ( portfolio, equity ) in data:
    equities[portfolio].append( equity )

navs = defaultdict(int)
for ( portfolio, equity, position ) in data:
    navs[portfolio] += position * prices[equity]
</pre>
</div>
</div></li></ul>
</div>
</div>
<div id="outline-container-orgfa6b4fa" class="outline-3">
<h3 id="orgfa6b4fa">Building &amp; Splitting Dictionaries</h3>
<div class="outline-text-3" id="text-orgfa6b4fa">
<ul class="org-ul">
<li>使用 zip 将 key list 和 value list 生成一个 dict</li>
<li>dict 的 key 是无序的，但是一但生成顺序不会变</li>
</ul>
</div>
</div>
<div id="outline-container-org4c677dc" class="outline-3">
<h3 id="org4c677dc">Testing for Truth Values</h3>
<div class="outline-text-3" id="text-org4c677dc">
<ul class="org-ul">
<li>测试是否为真，使用 <code>if x:</code> 而不要使用 <code>if x == True</code></li>
<li>测试是否为空，使用 <code>if itemsL</code> 而不要使用 <code>len(items) != 0</code> 或 <code>items != []</code></li>
</ul>
</div>
</div>
<div id="outline-container-org9ec2ac7" class="outline-3">
<h3 id="org9ec2ac7">Truth Values</h3>
<div class="outline-text-3" id="text-org9ec2ac7">
</div><div id="outline-container-org6e7eaba" class="outline-4">
<h4 id="org6e7eaba">基本类型</h4>
<div class="outline-text-4" id="text-org6e7eaba">
<p>
Python 中为 False 的值包括
</p>

<ul class="org-ul">
<li>False</li>
<li>""</li>
<li>0, 0.0</li>
<li>[], (), {}, set()</li>
<li>None</li>
</ul>

<p>
除此外都是 True
</p>
</div>
</div>




<div id="outline-container-org1f69372" class="outline-4">
<h4 id="org1f69372">自定义类型</h4>
<div class="outline-text-4" id="text-org1f69372">
<ul class="org-ul">
<li>容器类，定义 <code>__len__</code> 表示长度</li>
<li>非窗口类，定义 <code>__nonzero__</code> 表示是否为真</li>
<li>python3.0 中 <code>__nonzero__</code> 被重命名为 <code>__bool__</code></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgec67fc6" class="outline-3">
<h3 id="orgec67fc6">Index &amp; Item</h3>
<div class="outline-text-3" id="text-orgec67fc6">
<ul class="org-ul">
<li>使用 enumerate 函数来迭代 list，同时获取 index 和 item</li>
<li>enumerate 返回迭代器，会惰性求值，称为 generator</li>
</ul>
</div>
</div>

<div id="outline-container-org7cbf320" class="outline-3">
<h3 id="org7cbf320">Other language have "variables"</h3>
<div class="outline-text-3" id="text-org7cbf320">
<ul class="org-ul">
<li>Python 的动态类型语言</li>
<li>变量名称（atom）实际只是一个指针</li>
<li>指向的对象（object）本身有类型</li>
<li>当变量（object）没有被引用时，将在未来被回收内存</li>
<li>In Python, "variables" are nametags for values, not labelled boxes.</li>
</ul>
</div>
</div>




<div id="outline-container-org8ee6929" class="outline-3">
<h3 id="org8ee6929">Default Parameter Values</h3>
<div class="outline-text-3" id="text-org8ee6929">
</div><div id="outline-container-org61fe1d6" class="outline-4">
<h4 id="org61fe1d6">例子</h4>
<div class="outline-text-4" id="text-org61fe1d6">
<div class="org-src-container">
<pre class="src src-python">def bad_append( new_item, a_list=[] ):
    a_list.append( new_item )
    return a_list

print bad_append( "one" )
print bad_append( "two" )
</pre>
</div>
</div>
</div>


<div id="outline-container-org145d8e3" class="outline-4">
<h4 id="org145d8e3">说明</h4>
<div class="outline-text-4" id="text-org145d8e3">
<ul class="org-ul">
<li>函数的参数的默认值在函数定义处被调用</li>
<li>每次函数调用中使用的 <code>a_list</code> 都是同一个</li>
</ul>
</div>
</div>

<div id="outline-container-orgb271e99" class="outline-4">
<h4 id="orgb271e99">修改方法</h4>
<div class="outline-text-4" id="text-orgb271e99">
<div class="org-src-container">
<pre class="src src-python">def good_append( new_item, a_list=None ):
    if a_list is None:
	a_list = []
    a_list.append( new_item )
    return a_list
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orga9a9833" class="outline-3">
<h3 id="orga9a9833">String Formatting</h3>
<div class="outline-text-3" id="text-orga9a9833">
<ul class="org-ul">
<li>python 的 <code>%</code> 操作类似于 C 的 <code>sprintf</code></li>
<li>参考 <i>Python Library Reference</i>, section 2.3.6.2 "String Formatting Operations"</li>
</ul>
</div>
</div>

<div id="outline-container-orgcd7ef80" class="outline-3">
<h3 id="orgcd7ef80">Advanced String Formatting</h3>
<div class="outline-text-3" id="text-orgcd7ef80">
</div><div id="outline-container-orgd05c718" class="outline-4">
<h4 id="orgd05c718">interpolation</h4>
<div class="outline-text-4" id="text-orgd05c718">
<p>
可以使用 interpolation 机制来生成（注意安全）
</p>

<div class="org-src-container">
<pre class="src src-python">values = {name': name, 'messages': messages}
print ('Hello %(name)s, you have %(message)i messages' % values)

## or 
print ('Hello %(name)s, you have %(message)i messages' % locals())
</pre>
</div>
</div>
</div>
<div id="outline-container-org29a93a2" class="outline-4">
<h4 id="org29a93a2">object's instances attributes</h4>
<div class="outline-text-4" id="text-org29a93a2">
<ul class="org-ul">
<li>使用 <code>self.__dict__</code> 来将类对象的成员生成一个dict</li>
<li>可以用于生成格式化字符结果</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org418de1c" class="outline-3">
<h3 id="org418de1c">List Comprehensions</h3>
<div class="outline-text-3" id="text-org418de1c">
<ul class="org-ul">
<li>简称 listcomps</li>
<li>如 <code>[fn(item) for item in a_list if condition(item)]</code></li>
<li>更简洁更清晰</li>
<li>不宜过多的层级生成</li>
</ul>
</div>
</div>


<div id="outline-container-orgef085f3" class="outline-3">
<h3 id="orgef085f3">Generator Expression</h3>
<div class="outline-text-3" id="text-orgef085f3">
</div><div id="outline-container-org3dd62b7" class="outline-4">
<h4 id="org3dd62b7">例子</h4>
<div class="outline-text-4" id="text-org3dd62b7">
<div class="org-src-container">
<pre class="src src-python">print sum([num*num for num in range(1,101)])
print sum( num*num for num in range(1,101))

# more
month_codes = dict((fn(i+1), code)
  for i, code in enumerate( 'FGHJKMNQUVXZ' )
  for fn in (int, str))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgafdcc15" class="outline-4">
<h4 id="orgafdcc15">说明</h4>
<div class="outline-text-4" id="text-orgafdcc15">
<ul class="org-ul">
<li>简称 genexps</li>
<li>类似于 list comprehensions</li>
<li>不同之处在于 listcomps 是贪婪的，一次求值</li>
<li>generator 是惰性的，适合于处理长的序列</li>
<li>这里最好配合 <code>xrange</code> 使用</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org3d2f6d3" class="outline-3">
<h3 id="org3d2f6d3">Sorting</h3>
<div class="outline-text-3" id="text-org3d2f6d3">
<ul class="org-ul">
<li><code>list.sort()</code> 在原数组上排序</li>
<li>可以指定排序方法 cmp, 可以比较慢</li>
<li>更好的方法是指定 key 方法</li>
</ul>
</div>
</div>





<div id="outline-container-org90d6e95" class="outline-3">
<h3 id="org90d6e95">Generators</h3>
<div class="outline-text-3" id="text-org90d6e95">
<ul class="org-ul">
<li><code>yield</code> 将一个函数变成一个 generator</li>
<li>generator 函数返回一个 generator object</li>
<li>其中实现了迭代器需要的 next 方法（并以 <code>StopIteration</code> 异常为结束）</li>
<li>generator function 用维护迭代过程的状态</li>
<li>配合 for 使用</li>
<li>for 可以有一个 <code>else</code> 从句，在正常结束（非 break）时被调用</li>
</ul>
</div>
</div>





<div id="outline-container-org3bd4c2a" class="outline-3">
<h3 id="org3bd4c2a">EAFP vs. LBYL</h3>
<div class="outline-text-3" id="text-org3bd4c2a">
<ul class="org-ul">
<li>EAFP: easier to ask forgiveness than permission</li>
<li>LBYL: look before you leap</li>
<li>鸭子类型： If it walks like a duck, and talks like a duck, and looks like a duck: It's a duck</li>
<li>可以在对类型有要求的地方使用异常处理保护</li>
<li>不要直接捕 <code>except</code> 异常，而只针对期望的异常</li>
</ul>
</div>
</div>

<div id="outline-container-org78f572b" class="outline-3">
<h3 id="org78f572b">import</h3>
<div class="outline-text-3" id="text-org78f572b">
<ul class="org-ul">
<li>不要使用 <code>from module import *</code></li>
<li>这将污染 namespace 环境</li>
<li>可以通过起别名、显式导入方式来解决</li>
</ul>
</div>
</div>


<div id="outline-container-orgf6c854e" class="outline-3">
<h3 id="orgf6c854e">Modules &amp; Scripts</h3>
<div class="outline-text-3" id="text-orgf6c854e">
<ul class="org-ul">
<li><code>if __name__ == '__main__':</code> 来保存可执行语句</li>
<li>被导入时， <code>__name__</code> 被设置成模块的名称，因此不会执行</li>
<li>当直接运行时， <code>__name__</code> 被设置成 "<span class="underline"><span class="underline">main</span></span>"</li>
</ul>
</div>
</div>


<div id="outline-container-org169d15e" class="outline-3">
<h3 id="org169d15e">Module Structure</h3>
<div class="outline-text-3" id="text-org169d15e">
<pre class="example">
"""module docstring"""

# imports
# constants
# exception classes
# interface functions
# classes
# internal functions &amp; classes 

def main(...):
    ...

if __name__ == "__main__":
    status = main()
    sys.exit( status )
</pre>
</div>
</div>
<div id="outline-container-org28b2f98" class="outline-3">
<h3 id="org28b2f98">Packages</h3>
<div class="outline-text-3" id="text-org28b2f98">
</div><div id="outline-container-orgbcba17f" class="outline-4">
<h4 id="orgbcba17f">目录结构</h4>
<div class="outline-text-4" id="text-orgbcba17f">
<pre class="example">
package/
    __init__.py
    module1.py
    subpackage/
	__init__.py
	module2.py
</pre>
</div>
</div>


<div id="outline-container-orgd01e6c2" class="outline-4">
<h4 id="orgd01e6c2">使用方式</h4>
<div class="outline-text-4" id="text-orgd01e6c2">
<div class="org-src-container">
<pre class="src src-python">import package.module1
from package.subpackage import module2
from package.subpackage.module2 import name
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org2e30c61" class="outline-2">
<h2 id="org2e30c61">Simple is Better Than Complex</h2>
<div class="outline-text-2" id="text-org2e30c61">
<blockquote>
<p>
Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.
</p>
</blockquote>
</div>

<div id="outline-container-org7760dd3" class="outline-3">
<h3 id="org7760dd3">原则</h3>
<div class="outline-text-3" id="text-org7760dd3">
<ul class="org-ul">
<li>keep you programs simple</li>
<li>don't reinvent the wheel
<ul class="org-ul">
<li>check python's standard library.</li>
<li>check the python package index ( pip )</li>
<li>search the web.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zhao WenBin</p>
<p class="date">Created: 2017-06-11 Sun 11:52</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
